<a href="https://colab.research.google.com/github/AdhirajChaddha/Kaggle-Titanic-Callenge/blob/master/Titanic_Survival.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
testURL = 'https://raw.githubusercontent.com/AdhirajChaddha/Kaggle-Titanic-Callenge/master/test.csv'
trainURL = 'https://raw.githubusercontent.com/AdhirajChaddha/Kaggle-Titanic-Callenge/master/train.csv'

train = pd.read_csv(trainURL)
test = pd.read_csv(testURL)

In [28]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [29]:
# We dont need the coulmn for the name as it does not have any relation
train = train.drop(columns=['Name'])

# Male = 1, Female = 0
train.Sex.replace(['male', 'female'], [1, 0], inplace=True)

# Drop the cabin since it has too many incomplete values 
train = train.drop(columns=['Cabin', 'Ticket'])

# for Embarked, S = 0, C = 1, Q = 2
train.Embarked.replace(['S', 'C', 'Q'], [0, 1, 2], inplace=True)

train.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500       0.0
1            2         1       1    0  38.0      1      0  71.2833       1.0
2            3         1       3    0  26.0      0      0   7.9250       0.0
3            4         1       1    0  35.0      1      0  53.1000       0.0
4            5         0       3    1  35.0      0      0   8.0500       0.0